Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/seanad_panel_by_elections.html.txt.tmx
Source language: en
Languages: ga

source: When a casual vacancy occurs in the Seanad through the death, disqualification or resignation of a sub-panel member, the vacancy is filled by a bye-election
ga: Ó am go chéile tagann folúntas aníos sa Seanad, nuair a chailltear, nuair a dícháiltear nó nuair a éiríonn ball de fho-phainéal as, déantar an folúntas a líonadh le fo-thoghchán

source: To be nominated as a candidate for an Oireachtas sub-panel vacancy, any 9 members of the Dáil or Seanad must jointly nominate you
ga: Ní mór do 9 comhalta den Dáil nó den Seanad duine a chomhainmniú le bheith ina (h)iarrthóir do fholúntas ar fho-phainéal Oireachtais

source: To be nominated as a candidate for a nominating bodies sub-panel vacancy, you must be nominated by a registered nominating body for the relevant panel
ga: Ní mór don eagras cláraithe ainmniúcháin don phainéal cuí duine a ainmniú mar iarrthóir do fholúntas ar fho-phainéal na n-údarás ainmniúcháin

source: The electorate at a bye-election is composed of members of the Dáil and the Seanad only
ga: Teachtaí Dála agus comhaltaí an tSeanaid amháin a bhíonn vótaí acu i bhfo-thoghchán an tSeanaid

source: Voting is by secret ballot. The counting procedure is the same as at the general election except that only one candidate will be elected
ga: Ballóid rúnda a bhíonn ann agus déantar na vótaí a chomhaireamh leis an gcóras céanna d'ollthoghchán ach nach mbíonn ach iarrthóir amháin tofa
